# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "josh/tap"
tap "nshipster/formulae"

# Homebrew
brew "python@3.9"
brew "black"
brew "bloaty"
brew "cmake"
brew "deno"
brew "direnv"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "gopls"
brew "ipfs"
brew "isort"
brew "jq"
brew "node"
brew "jupyterlab"
brew "launchdns"
brew "mas"
brew "ninja"
brew "prettier"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "swift-format"
brew "swiftformat"
brew "swiftgen"
brew "swiftlint"
brew "syncthing", restart_service: :changed
brew "terminal-notifier"
brew "typescript"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "josh/tap/brew-unattended-upgrade"
brew "josh/tap/csv2json"
brew "josh/tap/displayrcd", restart_service: :changed
brew "josh/tap/ipfs-tools"
brew "josh/tap/swift-completions"
brew "nshipster/formulae/gyb"

# Cask
cask "aerial"
cask "docker"
cask "firefox"
cask "netnewswire"
cask "nova"
cask "scroll-reverser"
cask "sf-symbols"
cask "sketch"
cask "josh/tap/sort-lines"
cask "xbar"

# Mac App Store
mas "1Password 7", id: 1333542190
mas "Aware", id: 1082170746
mas "BBEdit", id: 404009241
mas "Deliveries", id: 290986013
mas "Developer", id: 640199958
mas "Drafts", id: 1435957248
mas "Fantastical", id: 975937182
mas "Hush", id: 1544743900
mas "iA Writer", id: 775737590
mas "Ka-Block!", id: 1335413823
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1346203938
mas "Scroll", id: 1477273814
mas "Slack", id: 803453959
mas "SQLPro for SQLite", id: 586001240
mas "SwitchGlass", id: 1498546559
mas "Tot", id: 1491071483
mas "Xcode", id: 497799835
mas "xScope", id: 889428659
