# Taps
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "josh/tap"
tap "mxcl/made"
tap "nektos/tap"
tap "nshipster/formulae"

# Homebrew
brew "python@3.8"
brew "black"
brew "bloaty"
brew "cmake"
brew "deno"
brew "direnv"
brew "fzf"
brew "git"
brew "gnupg"
brew "jq"
brew "node"
brew "jupyterlab"
brew "launchdns"
brew "mas"
brew "ninja"
brew "prettier"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "swift-format"
brew "swiftformat"
brew "swiftgen"
brew "swiftlint"
brew "terminal-notifier"
brew "typescript"
brew "wget"
brew "yarn"
brew "github/gh/gh"
brew "josh/tap/brew-unattended-upgrade"
brew "josh/tap/csv2json"
brew "josh/tap/swift-completions"
brew "josh/tap/tot"
brew "mxcl/made/swift-sh"
brew "nektos/tap/act"
brew "nshipster/formulae/gyb"

# Cask
cask "aerial"
cask "bartender"
cask "docker"
cask "firefox"
cask "netnewswire"
cask "scroll-reverser"
cask "sf-symbols"
cask "sketch"

# Mac App Store
mas "1Password 7", id: 1333542190
mas "Aware", id: 1082170746
mas "BBEdit", id: 404009241
mas "Deliveries", id: 924726344
mas "Developer", id: 640199958
mas "Drafts", id: 1435957248
mas "Fantastical", id: 975937182
mas "Ka-Block!", id: 1335413823
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1346203938
mas "Scroll", id: 1477273814
mas "Slack", id: 803453959
mas "Tot", id: 1491071483
mas "Xcode", id: 497799835
mas "xScope", id: 889428659
