# Taps
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "josh/tap"

# Homebrew
brew "black"
brew "direnv"
brew "gh"
brew "git"
brew "python@3.9"
brew "gnupg"
brew "go"
brew "icu4c"
brew "isort"
brew "jq"
brew "mas"
brew "node"
brew "prettier"
brew "pstree"
brew "qrencode"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "swift-format"
brew "swiftformat"
brew "swiftlint"
brew "terminal-notifier"
brew "wget"
brew "zbar"
brew "josh/tap/bbedit-cli"
brew "josh/tap/brew-unattended-upgrade"
brew "josh/tap/displayrcd", restart_service: :changed
brew "josh/tap/itunes-library-export"
brew "josh/tap/swift-completions"

# Cask
cask "cleanshot"
cask "firefox"
cask "mimestream"
cask "nova"
cask "scroll-reverser"
cask "sketch"
cask "slack"
cask "visual-studio-code"

# Mac App Store
mas "Actions", id: 1586435171
mas "BBEdit", id: 404009241
mas "Data Jar", id: 1453273600
mas "Deliveries", id: 290986013
mas "Developer", id: 640199958
mas "Fantastical", id: 975937182
mas "GameTrack", id: 1136800740
mas "Hidden Bar", id: 1452453066
mas "Hush", id: 1544743900
mas "Ka-Block!", id: 1335413823
mas "Kaleidoscope", id: 1575557335
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "Soulver 3", id: 1508732804
mas "SQLPro for SQLite", id: 586001240
mas "Super Agent", id: 1568262835
mas "TestFlight", id: 899247664
mas "Toggl Track", id: 957734279
mas "Tot", id: 1491071483
mas "Transmit", id: 1436522307
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
