# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "josh/tap"

# Homebrew
brew "direnv"
brew "eza"
brew "fzf"
brew "go"
brew "josh/tap/alacritty-catppuccin"
brew "josh/tap/itunes-library-export"
brew "josh/tap/tmux-catppuccin"
brew "josh/tap/tmux-sensible"
brew "josh/tap/tmux-tokyo-night"
brew "josh/tap/tmux-yank"
brew "josh/tap/tokyonight-extras"
brew "neovim"
brew "node"
brew "python@3.12"
brew "starship"
brew "tmux"
brew "topgrade"
brew "vim" # >= 9.1
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Cask
cask "alacritty"
cask "cursor"
cask "firefox"
cask "font-cascadia-code-nf"
cask "font-cascadia-code"
cask "font-cascadia-mono-nf"
cask "font-cascadia-mono"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-fira-mono-nerd-font"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-jetbrains-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-sf-mono-for-powerline"
cask "font-sf-mono"

cask "mimestream"
cask "obsidian"
cask "raycast"
cask "secretive"
cask "visual-studio-code"
cask "zed"
