# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "josh/tap"
tap "oven-sh/bun"
tap "pkgxdev/made"

# Homebrew
brew "age-plugin-se"
brew "age"
brew "bat"
brew "direnv"
brew "dockutil"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "josh/tap/alacritty-catppuccin"
brew "josh/tap/bat-catppuccin"
brew "josh/tap/bbedit-cli" if File.exist?("/Applications/BBEdit.app/Contents/_MASReceipt/receipt")
brew "josh/tap/itunes-library-export"
brew "josh/tap/tmtheme-rose-pine"
brew "josh/tap/tmux-catppuccin"
brew "josh/tap/tmux-sensible"
brew "josh/tap/tmux-tokyo-night"
brew "josh/tap/tmux-yank"
brew "josh/tap/tokyonight-extras"
brew "jq"
brew "lazygit"
brew "llm"
brew "mas"
brew "md5sha1sum"
brew "neovim"
brew "node"
brew "ollama", restart_service: true
brew "oven-sh/bun/bun"
brew "pkgxdev/made/pkgx"
brew "prettier"
brew "python@3.12"
brew "rclone"
brew "restic"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stylua"
brew "swift-format"
brew "swiftformat"
brew "swiftlint"
brew "tailscale"
brew "taplo"
brew "tmux"
brew "topgrade"
brew "tree"
brew "uv"
brew "vim" # >= 9.1
brew "watch"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Cask
cask "alacritty"
cask "firefox"
cask "font-cascadia-code-nf"
cask "font-cascadia-code"
cask "font-cascadia-mono-nf"
cask "font-cascadia-mono"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-fira-mono-nerd-font"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-jetbrains-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-sf-mono-for-powerline"
cask "font-sf-mono"
cask "font-zed-mono-nerd-font"
cask "font-zed-mono"
cask "font-zed-sans"

cask "mimestream"
cask "obsidian"
cask "raycast"
cask "secretive"
cask "visual-studio-code"
cask "zed"
