# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "josh/tap"
tap "oven-sh/bun"

# Homebrew
brew "awscli"
brew "direnv"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "gron"
brew "icu4c"
brew "josh/tap/bbedit-cli"
brew "josh/tap/itunes-library-export"
brew "jq"
brew "mas"
brew "md5sha1sum"
brew "node"
brew "ollama", restart_service: true
brew "openssl@1.1"
brew "oven-sh/bun/bun"
brew "prettier"
brew "pstree"
brew "pv"
brew "python@3.11"
brew "restic"
brew "ripgrep"
brew "ruff"
brew "shellcheck"
brew "shfmt"
brew "swiftformat"
brew "swiftlint"
brew "tailscale"
brew "terminal-notifier"
brew "watch"
brew "wget"

# Cask
cask "firefox"
cask "logi-options-plus" if `ioreg -p IOUSB` =~ /USB Receiver/
cask "mimestream"
cask "raycast"
cask "secretive"
cask "visual-studio-code"
cask "zed"
